'use strict';

let foodlist = {
      'food': [

         // Каши
         {
            'name': 'Рисовая каша',
            'type': 'porrige',
            'ingridients': {
               'рис': 75,
               'вода': 300,
               'молоко сухое': 20,
               'сухофрукты': 10,
               'сгущенка': 20,
               'соль': 2
            }
         },
         {
            'name': 'Гречневая каша',
            'type': 'porrige',
            'ingridients': {
               'гречка': 100,
               'молоко сухое': 10,
               'сгущенка': 20,
               'сахар': 10,
               'соль': 2
            }
         },
         {
            'name': 'Пшенная каша',
            'type': 'porrige',
            'ingridients': {
               'пшено': 80,
               'молоко сухое': 40,
               'сахар': 10,
               'соль': 2
            }
         },
         {
            'name': 'Манная каша',
            'type': 'porrige',
            'ingridients': {
               'манка': 70,
               'молоко сухое': 20,
               'сахар': 10,
               'соль': 2
            }
         },
         {
            'name': 'Овсяная каша',
            'type': 'porrige',
            'ingridients': {
               'овсяные хлопья': 70,
               'молоко сухое': 40,
               'соль': 2,
               'сахар': 10
            }
         },


         // Супы
         {
            'name': 'Рыбный суп',
            'type': 'soup',
            'ingridients': {
               'рыба': 60,
               'картошка': 50,
               'морковь': 50,
               'соль': 10
            }
         },


         // Напитки
         {
            'name': 'Чай рассыпной',
            'type': 'drink',
            'ingridients': {
               'чай листовой': 5,
               'сахар': 20
            }
         },
         {
            'name': 'Чай пакетированный',
            'type': 'drink',
            'ingridients': {
               'пакетик чая': 1,
               'сахар': 20
            }
         },
         {
            'name': 'Кофе',
            'type': 'drink',
            'ingridients': {
               'кофе растворимый': 5,
               'молоко сухое': 20,
               'сахар': 20
            }
         },
         {
            'name': 'Какао',
            'type': 'drink',
            'ingridients': {
               'какао порошок': 10,
               'молоко сухое': 10,
               'сахар': 10
            }
         },
         {
            'name': 'Кисель',
            'type': 'drink',
            'ingridients': {
               'кисель сухой': 50,
               'сахар': 30
            }
         }
      ]
};

export {foodlist};
